src/cf/maERP_ib/src/Reports/ЗарплатаСотрудника/ЗарплатаСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЗарплатаСотрудника</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>EnumRef.Месяца</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СформироватьДля</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
</mdclass:Report>

src/cf/maERP_ib/src/Reports/ЗарплатаСотрудника/Forms/ФормаОтчета/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Месяц = Перечисления.Месяца.ПолучитьМесяцПоНомеру(Месяц(ТекущаяДатаСеанса()));
	Отчет.Год = Год(ТекущаяДатаСеанса());
	Отчет.СформироватьДля = ПараметрыСеанса.Пользователь.ФизическоеЛицо;
	Если Не РольДоступна(Метаданные.Роли.Администратор) и Не РольДоступна(Метаданные.Роли.Руководитель) Тогда
		Элементы.СформироватьДля.Доступность = Ложь;
	КонецЕсли;
	//Если РольДоступна(Метаданные.Роли.ДиректорПоПродажам) Тогда
	//	Элементы.Сотрудник.Доступность = Истина;
	//	Элементы.Сотрудник.РедактированиеТекста = Ложь;
	//	Элементы.Сотрудник.КнопкаВыбора = Ложь;
	//	Элементы.Сотрудник.КнопкаВыпадающегоСписка = Истина;
	//	Группа = Справочники.ФизическиеЛица.НайтиПоНаименованию("Менеджеры по продажам");
	//	Если ЗначениеЗаполнено(Группа) Тогда
	//		Выб = Справочники.Сотрудники.Выбрать(Группа);
	//		Пока Выб.Следующий() Цикл
	//			Элементы.Сотрудник.СписокВыбора.Добавить(Выб.Ссылка);		
	//		КонецЦикла;
	//	КонецЕсли;
	//	Группа = Справочники.ФизическиеЛица.НайтиПоНаименованию("Менеджеры");
	//	Если ЗначениеЗаполнено(Группа) Тогда
	//		Выб = Справочники.Сотрудники.Выбрать(Группа);
	//		Пока Выб.Следующий() Цикл
	//			Элементы.Сотрудник.СписокВыбора.Добавить(Выб.Ссылка);		
	//		КонецЦикла;
	//	КонецЕсли;
	//	Элементы.Сотрудник.СписокВыбора.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	//КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура СформироватьНаСервере()
	Отчет.ПериодРасчета = Дата(Отчет.Год, Перечисления.Месяца.ПолучитьНомерМесяцаПоНаименованию(Отчет.Месяц), 1);
	Таб.Очистить();
	Если ТипЗнч(Отчет.СформироватьДля) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		МасСотрудники = Новый Массив;
		МасСотрудники.Добавить(Отчет.СформироватьДля);
	Иначе // Подразделения
		МасСотрудники = РегистрыСведений.ТарифныеСтавки.ПолучитьВсехСотрудниковВПодразделении(Отчет.СформироватьДля, Отчет.ПериодРасчета);	
	КонецЕсли;	
	Ном = 1;
	Для Каждого Сотрудник Из МасСотрудники Цикл
		// Получаем данные
		Структура = РегистрыНакопления.Зарплата.РассчитатьПоСотруднику(Сотрудник, Отчет.ПериодРасчета);
		// Выводим отчет
		Предупреждение = ?(Структура.Оклад.ЧасовФакт = 0, Нстр("fr = ""; Important! La feuille de temps n'a pas été renseignée, le salaire ne sera pas calculé !""; ru = '; Важно! Не введен табель, оклад рассчитан не будет!'; en = '; Important! The report card has not been entered, the salary will not be calculated!'; es = '; Importante! ¡No se introduce la tabla, el salario no se calculará!'"), "");
		Объект = РеквизитФормыВЗначение("Отчет");
		Макет = Объект.ПолучитьМакет("Макет");
		оШапка = Макет.ПолучитьОбласть("Шапка");
		оШапкаНачисленияУдержания = Макет.ПолучитьОбласть("ШапкаНачисленияУдержания");
		оСтрокаНачисленияУдержания = Макет.ПолучитьОбласть("СтрокаНачисленияУдержания");
		оШапкаПремии = Макет.ПолучитьОбласть("ШапкаПремии");
		оТипПоказателяПремии = Макет.ПолучитьОбласть("ТипПоказателяПремии");
		оСтрокаПремии = Макет.ПолучитьОбласть("СтрокаПремии");
		оШапкаШтрафы = Макет.ПолучитьОбласть("ШапкаШтрафы");
		оСтрокаШтрафы = Макет.ПолучитьОбласть("СтрокаШтрафы");
		// Выводим
		//оШапка.Параметры.ВыходовПлан = Структура.Оклад.ВыходовПланПоГрафикуПредставление;
		//оШапка.Параметры.ВыходовФакт = Структура.Оклад.ВыходовФактПредставление;
		оШапка.Параметры.Сотрудник = Сотрудник;
		оШапка.Параметры.ПериодРасчета = Формат(Отчет.ПериодРасчета, "ДФ='MMММ yyyy ""г.""'");
		//оШапка.Параметры.Предупреждение = Предупреждение;
		оШапка.Параметры.Оклад = Формат(Структура.Оклад.Сумма, "ЧЦ=12; ЧДЦ=2; ЧН=") + " руб.";	
		//оШапка.Параметры.Премия = Формат(Структура.Премия.Сумма, "ЧЦ=12; ЧДЦ=2; ЧН=") + " руб.";;
		оШапка.Параметры.ПрочиеНачисления = Формат(Структура.Прочее.ВсегоНачислено, "ЧЦ=12; ЧДЦ=2; ЧН=") + " руб.";
		оШапка.Параметры.ПрочиеУдержания = Формат(Структура.Прочее.ВсегоУдержано, "ЧЦ=12; ЧДЦ=2; ЧН=") + " руб.";	
		оШапка.Параметры.Итого = Формат(Структура.Итого, "ЧЦ=12; ЧДЦ=2; ЧН=") + " руб.";
		Таб.Вывести(оШапка);
		Если Структура.Прочее.ТЗРасшифровка.Количество() > 0 Тогда 
			Таб.Вывести(оШапкаНачисленияУдержания);
			Для Каждого Стр Из Структура.Прочее.ТЗРасшифровка Цикл
				оСтрокаНачисленияУдержания.Параметры.СтатьяЗатрат = Стр.СтатьяЗатрат;
				оСтрокаНачисленияУдержания.Параметры.Сумма = ?(Стр.ВидДвижения = ВидДвиженияНакопления.Приход, 1, -1) * Стр.Сумма;
				Таб.Вывести(оСтрокаНачисленияУдержания);
			КонецЦикла;
		КонецЕсли;
		//Если Структура.Премия.ТЗПоказатели.Количество() > 0 Тогда
		//	Таб.Вывести(оШапкаПремии);
		//	ТЗТипыПоказателей = Структура.Премия.ТЗПоказатели.Скопировать();
		//	ТЗТипыПоказателей.Свернуть("SMART");
		//	ТЗТипыПоказателей.Сортировать("SMART");
		//	Для Каждого СтрПоказатель Из ТЗТипыПоказателей Цикл
		//		Если СтрПоказатель.SMART Тогда
		//			оТипПоказателяПремии.Параметры.ТипПоказателя = "SMART - задачи";
		//			Таб.Вывести(оТипПоказателяПремии);
		//		КонецЕсли;	
		//		МасПоказатели = Структура.Премия.ТЗПоказатели.НайтиСтроки(Новый Структура("SMART", СтрПоказатель.SMART));	
		//		Для Каждого Стр Из МасПоказатели Цикл
		//			оСтрокаПремии.Параметры.Заполнить(Стр);
		//			// Добавим примечание
		//			Примечание = "";
		//			Если ЗначениеЗаполнено(Стр.Комментарий) Тогда
		//				Примечание = Стр.Комментарий;	
		//			Иначе	
		//				//ТЗУсловияПоказателя = Справочники.ВариантыРасчётаПремий.ПолучитьУсловияПоказателя(Выб.ВариантРасчётаПремии, Стр.Показатель);
		//				//ТЗУсловияПоказателя.Сортировать("Условие");
		//				//Для Каждого СтрПримечание Из ТЗУсловияПоказателя Цикл
		//				//	Примечание = Примечание + ?(ЗначениеЗаполнено(Примечание), Символы.ПС, "") + СтрПримечание.Условие + " - " + СтрПримечание.Значение;	
		//				//КонецЦикла;
		//			КонецЕсли;
		//			ОбластьПримечания = оСтрокаПремии.ПолучитьОбласть(1, 2, 1, 2).ТекущаяОбласть;
		//			ОбластьПримечания.Параметр = СокрЛП(Стр.Показатель);
		//			ОбластьПримечания.Примечание.Текст = Примечание;
		//			оСтрокаПремии.ВставитьОбласть(ОбластьПримечания, оСтрокаПремии.ПолучитьОбласть(1, 2, 1, 2)); // Заменим старую область на новую 
		//			Таб.Вывести(оСтрокаПремии);	
		//		КонецЦикла;
		//	КонецЦикла;
		//КонецЕсли;
		//Если Структура.Премия.ТЗШтрафы.Количество() > 0 Тогда
		//	Таб.Вывести(оШапкаШтрафы);	
		//	Для Каждого Стр Из Структура.Премия.ТЗШтрафы Цикл
		//		оСтрокаШтрафы.Параметры.Заполнить(Стр);
		//		Таб.Вывести(оСтрокаШтрафы);
		//	КонецЦикла;
		//КонецЕсли;
		Таб.ВывестиГоризонтальныйРазделительСтраниц();
		Ном = Ном + 1;
	КонецЦикла;
	Таб.АвтоМасштаб = Истина;
КонецПроцедуры	

#КонецОбласти
